In [1]:
import numpy as np
import pandas as pd

[簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？
 
 - df.loc[ '2013-01-01', 'A'] 
 - df.loc[ '2013-01-01', ['A', 'B'] ] 
 - df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
 - df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] c

請根據提供的資料，選擇出下列的要求：

 - select the first 3 rows.
 - select the odd rows. (index = 1, 3, 5)
 - select the last 2 columns.
 - select the even columns. (index = 0, 2, 4)

In [49]:
df = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0  1.350911  1.736587  0.598040
1  2.299221  0.035529  1.497990
2 -0.897832 -1.505454 -0.306460
3  2.133920 -0.398738  0.042474
4 -0.420629  0.263967  0.092046
5  1.773333 -0.395893 -0.133472

In [46]:
df[0:3]
df.iloc[0:3,:]
df.iloc[0:3]

    a   b   c   d
0  20  34  28  30
1  38  12  20  24
2  30  20  26  23

In [47]:
df.iloc[1::2,:]

     a   b   c   d
1   38  12  20  24
3   25  21  37  19
5   23  35  19  11
7   14  23  10  31
9   34  12  29  16
11  16  20  30  37
13  34  18  10  15

In [50]:
print(df[['col2','col3']])
df.iloc[:,-2:]

       col2      col3
0  1.736587  0.598040
1  0.035529  1.497990
2 -1.505454 -0.306460
3 -0.398738  0.042474
4  0.263967  0.092046
5 -0.395893 -0.133472

       col2      col3
0  1.736587  0.598040
1  0.035529  1.497990
2 -1.505454 -0.306460
3 -0.398738  0.042474
4  0.263967  0.092046
5 -0.395893 -0.133472

In [51]:
print(df[['col3']])
df.iloc[:,0::2]

       col3
0  0.598040
1  1.497990
2 -0.306460
3  0.042474
4  0.092046
5 -0.133472

       col1      col3
0  1.350911  0.598040
1  2.299221  1.497990
2 -0.897832 -0.306460
3  2.133920  0.042474
4 -0.420629  0.092046
5  1.773333 -0.133472

請根據提供的資料，選擇出下列的要求：
 - 1. filtered by first column > 20?
 - 2. filtered by first column + second column > 50
 - 3. filtered by first column < 30 or second column > 30
 - 4. filtered by total sum of row > 100

In [54]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4),columns=['a','b','c','d'])
df

     a   b   c   d
0   21  28  23  31
1   26  38  19  27
2   17  13  28  39
3   32  10  11  19
4   36  39  38  33
5   21  32  38  24
6   18  38  32  21
7   29  29  14  13
8   17  32  21  26
9   32  34  17  20
10  16  34  22  39
11  14  29  10  20
12  25  17  37  32
13  28  18  34  31
14  33  26  17  29

In [40]:
print(df[df['a']>20])

     a   b   c   d
1   38  12  20  24
2   30  20  26  23
3   25  21  37  19
4   36  12  35  14
5   23  35  19  11
6   22  27  20  39
9   34  12  29  16
12  38  24  16  14
13  34  18  10  15

In [41]:
print(df[(df['a']+df['b'])>50])

     a   b   c   d
0   20  34  28  30
5   23  35  19  11
12  38  24  16  14
13  34  18  10  15

In [42]:
print(df[(df['a']+df['b']+df['c']+df['d'])>100])

     a   b   c   d
0   20  34  28  30
3   25  21  37  19
6   22  27  20  39
11  16  20  30  37

In [55]:
df[np.logical_or(df['a']<30,df['b']>30)]

     a   b   c   d
0   21  28  23  31
1   26  38  19  27
2   17  13  28  39
4   36  39  38  33
5   21  32  38  24
6   18  38  32  21
7   29  29  14  13
8   17  32  21  26
9   32  34  17  20
10  16  34  22  39
11  14  29  10  20
12  25  17  37  32
13  28  18  34  31